# 1장 서울시 구별 CCTV 현황 분석
이제 첫 작업입니다. 설레는 마음을 잠시 누르면서 먼저 목표에 대해 이야기하겠습니다. 이번 1장에서는 서울시 구별 CCTV 현황을 분석합니다. 단순히 어디에 CCTV가 많이 설치됐는지부터 시작해서 구별 인구 대비 비율을 확인하는 것까지 진행합니다. 특히 인구 현황을 보면서 구별 인구 현황에 대해서도 확인해볼까 합니다.  그리고 구별 CCTV 현환을 시각화하는 부분도 이야기하려고 합니다. 그리고 이런 과정을 거치면서 이 책이 여러분에게 바라는 것은 1장을 학습하면서 파이썬의 기초를 학습하고, pandas와 Matplotlib의 기초에 대해서도 익히기를 기대하고 있습니다.

## 1-2 파이썬에서 텍스트 파일과 엑셀 파일 읽기 - pandas

1-1절에서 우리는 CSV파일과 엑셀 파일을 하나씩 얻었습니다. 파이썬에서는 이런 종류의 파일을 아주 손쉽게 읽을 수 있는 모듈이 있습니다. 바로 pandas라는 모듈입니다. Anaconda에서는 기본으로 설치되므로 그냥 사용하면 됩니다.

In [2]:
import pandas as pd

아마 앞으로도 위 코드처럼 대부분의 시작은 import로 하게 도딜 겁니다. 파이썬에서 원하는 모듈을 불러오는 명령이 import입니다. 그 뒤에 원하는 모듈명을 넣게 됩니다. 모듈명 다음의 as는 as 뒤에 붙는 pd라는 짧은 단어로 pandas를 대체하겠다는 뜻입니다. 즉,pandas의 read_csv라는 의미로 pandas.read_csv라고 하지 않고 pd.read_csv라고 쓰겠다는 의미입니다.<br>
pandas에서 CSV 파일을 읽는 명령은 read_csv입니다. 그 안에 한글을 사용하는 경우는 인코딩에서 신경 써야 합니다. 우리가 받은 CCTV 데이터는 UTF-8로 인코딩 되어 있어서 read_csv 명령을 쓸 때 encoding옵션에 UTF-8이라고 지정합니다. 이때 사용되는 head() 명령은 pandas 데이터의 첫 5행만 보여달라는 것입니다.

In [3]:
CCTV_Seoul = pd.read_csv('data/01. CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

pandas 데이터는 제일 첫 줄에 보이는 것이 해당하는 열(column)을 대표하는 일종의 제목입니다. 그래서 첫 줄을 특별히 column이라고 합니다. 데이터 뒤에 columns라고 하면 column의 이름들이 반환됩니다.

In [4]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [5]:
CCTV_Seoul.columns[0]

'기관명'

그런데 기관명이라고 되어 있으니 이를'구별'이라는 이름으로 하겠습니다 이렇게 이름을 바꾸는 명령은 rename이라고 합니다. 그리고 그 명령 안에 사용된 inplace=True는 실제 CCTV_Seoul이라는 변수의 내용을 갱신하라는 의미입니다.

In [6]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

이제 두 번째 받은 엑셀 파일을 읽어야 합니다. 그 명령은 read_excel입니다. 그냥 인코딩만 지정하고 읽었더니 약간 이상합니다. 그것은 원본 엑셀 파일이 그림 1-8에서 보는 것처럼 첫 세줄이 열의 제목 처럼 되어 있기 때문입니다.

In [7]:
pop_Seoul = pd.read_excel('data/01. population_in_Seoul.xls')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

그래서 엑셀 파일을 읽을 때는 옵션을 좀 더 많이 적용하도록 하겠습니다. 일단 엑셀을 읽는 read_excel 명령 안에서 세 번째 줄부터 읽으라는 header=2라는 옵션을 걸고, B,D,G,J,N 열만 읽도록 parse_cols='B,D,G,J,N'이라는 옵션을 넣었습니다.

In [8]:
pop_Seoul = pd.read_excel('data/01. population_in_Seoul.xls',
                         header = 2,
                         usecols = 'B, D, G, J, N' )

pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

출력된 모습도 간결하게 되었습니다. 그러나 컬럼의 이름에 문제가 있는 듯합니다. rename 명령을 사용해서 컬럼의 이름을 변경합니다.

In [9]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별',
                          pop_Seoul.columns[1] : '인구수',
                          pop_Seoul.columns[2] : '한국인',
                          pop_Seoul.columns[3] : '외국인',
                          pop_Seoul.columns[4] : '고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

이제 어느 정도 정리된 것 같습니다. CCTV_Seoul이라는 변수에는 '구별 CCTV 현황'을, pop_Seoul이라는 변수에는'구별 인구 현황'을 저장했습니다. pandas에서 몇 줄 입력하지 않았는데 우리는 두 종류의 파일을 보기 좋게 읽게 되었습니다.

## 1-3 pandas 기초 익히기
이 책의 목적을 이루는 과정을 더 중요하게 다루지만 그래도 책 전반에 걸쳐 pandas의 사용 빈도가 높아서 기초를 익히고 지나가겠습니다. 빠르게 진행할 테니 집중하세요. 그리고 본 절의 튜토리얼은 pandas의 튜토리얼이 다수 포함되어 있습니다.

In [10]:
import pandas as pd
import numpy as np

pandas와 Numpy를 import 했습니다. 이 두 모듈은 자주 사용되는 모듈이면서 둘을 함께 쓰면 유용할 때가 많습니다.

In [11]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

pandas의 데이터 유형 중 기초가 되는 것이 Series입니다. 대괄호로 만드는 파이썬의 list 데이터로 만들 수 있습니다. 중간에 NaN(Not A Number)도 넣었습니다.

In [12]:
dates = pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

또 pandas에는 날짜형의 데이터인 date_range가 있습니다. 기본 날짜를 지정하고 periods 옵션으로 6일간이라고 지정합니다.

In [13]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])

df

                   A         B         C         D
2013-01-01  0.027200 -1.020531  1.772950  0.837319
2013-01-02 -1.326676 -0.367714 -0.393435 -0.433656
2013-01-03 -1.623406 -0.949959 -2.115550  1.423069
2013-01-04 -1.822309 -0.027041  0.622573  0.248897
2013-01-05 -0.006449  0.560998 -0.915864  0.329220
2013-01-06 -1.165994  1.003240 -1.288996 -1.198633

이제 DataFrame 유형의 데이터를 만듭니다. 6행4열의 random 변수를 만들고, 컬럼에는 columns=['A','B','C','D']로 지정하고, index 명령으로 코드[11]에서 만든 날짜형 데이터인 dates를 index=dates 옵션을 이용해서 지정했습니다.

In [14]:
df.head(3)

                   A         B         C         D
2013-01-01  0.027200 -1.020531  1.772950  0.837319
2013-01-02 -1.326676 -0.367714 -0.393435 -0.433656
2013-01-03 -1.623406 -0.949959 -2.115550  1.423069

head() 명령을 사용하면 기본적으로 첫5행을 보여줍니다. 괄호 안에 숫자를 넣어두면 그 숫자만큼의 행을 볼 수 있습니다.

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

그리고 index, columns 명령을 이용하면 pandas의 DataFrame의 컬럼과 인덱스를 확인할 수 있습니다.

In [17]:
df.values

array([[ 0.02720042, -1.0205314 ,  1.77295015,  0.83731853],
       [-1.32667576, -0.36771375, -0.39343459, -0.4336555 ],
       [-1.62340613, -0.94995948, -2.11555014,  1.4230686 ],
       [-1.82230914, -0.02704078,  0.62257251,  0.24889694],
       [-0.00644919,  0.56099836, -0.91586392,  0.3292204 ],
       [-1.16599441,  1.00323961, -1.28899604, -1.19863312]])

그리고 그 안에 들어가는 내용은 values 명령으로 확인할 수 있습니다. 또, info()명령을 사용하면 DataFrame의 개요를 알 수 있습니다.

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

describe() 명령을 사용하면 통계적 개요를 확인할 수 있습니다. 코드[19]에서처럼 개수 (count)와 평균(mean)뿐만 아니라 min.max와 각 1/4 지점, 표준편차까지 한 번에 알 수 있습니다.

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.986272 -0.133501 -0.386387  0.201036
std    0.805016  0.811680  1.397558  0.925078
min   -1.822309 -1.020531 -2.115550 -1.198633
25%   -1.549224 -0.804398 -1.195713 -0.263017
50%   -1.246335 -0.197377 -0.654649  0.289059
75%   -0.296335  0.413989  0.368571  0.710294
max    0.027200  1.003240  1.772950  1.423069

이때 values가 숫자가 아니라 문자라고 핟더라도 그에 맞는 개요가 나타납니다.

In [20]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-06 -1.165994  1.003240 -1.288996 -1.198633
2013-01-05 -0.006449  0.560998 -0.915864  0.329220
2013-01-04 -1.822309 -0.027041  0.622573  0.248897
2013-01-02 -1.326676 -0.367714 -0.393435 -0.433656
2013-01-03 -1.623406 -0.949959 -2.115550  1.423069
2013-01-01  0.027200 -1.020531  1.772950  0.837319

sort_values 명령은 by로 지정된 컬럼을 기준으로 정렬합니다. ascending 옵션을 사용하면 내림차순이나 오름차순으로 정렬시킬 수 있습니다.

In [21]:
df

                   A         B         C         D
2013-01-01  0.027200 -1.020531  1.772950  0.837319
2013-01-02 -1.326676 -0.367714 -0.393435 -0.433656
2013-01-03 -1.623406 -0.949959 -2.115550  1.423069
2013-01-04 -1.822309 -0.027041  0.622573  0.248897
2013-01-05 -0.006449  0.560998 -0.915864  0.329220
2013-01-06 -1.165994  1.003240 -1.288996 -1.198633

그냥 변수명을 적고 실행하면 그 내용이 나타납니다. 내용이 너무 많은 경우는 Jupyter Notebook에서 내용을 줄여서 보여줍니다.

In [22]:
df['A']

2013-01-01    0.027200
2013-01-02   -1.326676
2013-01-03   -1.623406
2013-01-04   -1.822309
2013-01-05   -0.006449
2013-01-06   -1.165994
Freq: D, Name: A, dtype: float64

DataFrame으로 선언된 변수의 경우 변수명 뒤에 ['A']와 같이 붙여주면 해당 컬럼만 Series로 보여줍니다. 물론 head()라는 명령이 있지만 중간부터 보고 싶다면 행의 범위만 지정해서 df[0:3]이라고 하면 됩니다.

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  0.027200 -1.020531  1.772950  0.837319
2013-01-02 -1.326676 -0.367714 -0.393435 -0.433656
2013-01-03 -1.623406 -0.949959 -2.115550  1.423069

만약 2013.01.02부터 2013.01.04까지의 행을 보고 싶다면 df['20130102':'20130104']라고 하면 됩니다.

In [24]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.326676 -0.367714 -0.393435 -0.433656
2013-01-03 -1.623406 -0.949959 -2.115550  1.423069
2013-01-04 -1.822309 -0.027041  0.622573  0.248897

코드 [11]에서 만든 dates 변수를 이용해서 특정 날짜의 데이터만 보고 싶으면 df.loc명령을 사용하면 됩니다. loc는 location 옵션으로 슬라이싱(우리가 지금 하고 있는 겁니다.)할 때 loc 옵션을 이용해서 위치 값을 지정할 수 있습니다.

In [25]:
df.loc[dates[0]]

A    0.027200
B   -1.020531
C    1.772950
D    0.837319
Name: 2013-01-01 00:00:00, dtype: float64

A,B열의 모든 행을 보고 싶다면 df.loc[:,['A','B']]라고 하면 됩니다.

In [26]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.027200 -1.020531
2013-01-02 -1.326676 -0.367714
2013-01-03 -1.623406 -0.949959
2013-01-04 -1.822309 -0.027041
2013-01-05 -0.006449  0.560998
2013-01-06 -1.165994  1.003240

물론 행과 열의 범위를 모두 지정할 수도 있습니다.

In [27]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.326676 -0.367714
2013-01-03 -1.623406 -0.949959
2013-01-04 -1.822309 -0.027041

2013년 1월 2일부터 2013년 1월 4일까지의 데이터 중 A와 B 컬럼의 데이터만 선택하는 것입니다.

In [28]:
df.loc['20130102',['A','B']]

A   -1.326676
B   -0.367714
Name: 2013-01-02 00:00:00, dtype: float64

또, 2013년 1월 2일의 A,B 컬럼의 내용을 확인하는 것입니다.

In [29]:
df.loc[dates[0],'A']

0.027200417281381246

그리고 코드[11]에 있는 dates[0]에 맞는 날짜인 2013년 1월1일에 A컬럼의 데이터만 확인할 수 있습니다. 그러나 loc 명령과 달리 행과 열의 번호를 이용해서 데이터에 바로 접근하고 싶을 수 있는데, 그 명령이 iloc입니다. <br>
iloc을 사용하면 행이나 열의 범위를 지정하면 됩니다. 특히 콜론(:)을 사용하면 전체를 의미합니다.

In [30]:
df.iloc[3]

A   -1.822309
B   -0.027041
C    0.622573
D    0.248897
Name: 2013-01-04 00:00:00, dtype: float64

먼저 iloc에 단지 숫자만 표시하면 3번 행을 의미합니다. (0번부터 시작하니까 4번 행이 됩니다.)

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.822309 -0.027041
2013-01-05 -0.006449  0.560998

또 3번째부터 5번째 앞, 즉 3번째부터 4번째까지 행과 0번부터 1번까지 열의 데이터만 가져올 수 있습니다.

In [33]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.326676 -0.393435
2013-01-03 -1.623406 -2.115550
2013-01-05 -0.006449 -0.915864

또 번위가 아니라(,)로 행이나 열을 지정해서 데이터를 가져올 수 있습니다. 행이나 열에 대해 한쪽은 전체를 의미하게 하고 싶을 때는 그냥 콜론만 사용하변 됩니다.

In [34]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.326676 -0.367714 -0.393435 -0.433656
2013-01-03 -1.623406 -0.949959 -2.115550  1.423069

이렇게 행은 범위를 주고, 열은 콜론으로 전체를 의미하게 하는 것입니다.

In [36]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.020531  1.772950
2013-01-02 -0.367714 -0.393435
2013-01-03 -0.949959 -2.115550
2013-01-04 -0.027041  0.622573
2013-01-05  0.560998 -0.915864
2013-01-06  1.003240 -1.288996

반대로 행을 전체로 선택했습니다. 다시 df를 호출하겠습니다.

In [37]:
df

                   A         B         C         D
2013-01-01  0.027200 -1.020531  1.772950  0.837319
2013-01-02 -1.326676 -0.367714 -0.393435 -0.433656
2013-01-03 -1.623406 -0.949959 -2.115550  1.423069
2013-01-04 -1.822309 -0.027041  0.622573  0.248897
2013-01-05 -0.006449  0.560998 -0.915864  0.329220
2013-01-06 -1.165994  1.003240 -1.288996 -1.198633

DataFrame에서 특정 조건을 만족하는 데이터만 얻을 수 있습니다. 컬럼을 지정할 때 df['A']처럼 할 수도 있고, df.A와 같이 할 수도 있습니다. 컬럼A에서 0보다 큰 행만 얻는 것입니다.

In [39]:
df[df.A > 0]

                 A         B        C         D
2013-01-01  0.0272 -1.020531  1.77295  0.837319

데이터 전체에서 조건을 걸면 만족하지 않은 곳은 NaN 처리가 됩니다.

In [41]:
df[df > 0]

                 A         B         C         D
2013-01-01  0.0272       NaN  1.772950  0.837319
2013-01-02     NaN       NaN       NaN       NaN
2013-01-03     NaN       NaN       NaN  1.423069
2013-01-04     NaN       NaN  0.622573  0.248897
2013-01-05     NaN  0.560998       NaN  0.329220
2013-01-06     NaN  1.003240       NaN       NaN

DataFrame을 복사할 때는 그냥 = 기호를 이용해서 복사하면 실제 데이터의 내용이 복사되는 것이 아니라 데이터 위치만 복사되기 때문에 원본 데이터는 하나만 있게 됩니다.

In [42]:
df2 = df.copy()

데이터의 내용까지 복사하라는 지령은 copy() 옵션을 붙여 넣으면 됩니다.

In [43]:
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.027200 -1.020531  1.772950  0.837319    one
2013-01-02 -1.326676 -0.367714 -0.393435 -0.433656    one
2013-01-03 -1.623406 -0.949959 -2.115550  1.423069    two
2013-01-04 -1.822309 -0.027041  0.622573  0.248897  three
2013-01-05 -0.006449  0.560998 -0.915864  0.329220   four
2013-01-06 -1.165994  1.003240 -1.288996 -1.198633  three

원래 있는 DataFrame에서 새로운 컬럼을 추가하는 것은 코드[39]에서처럼 하면 됩니다.

In [45]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

이렇게 만든 E컬럼에서 two와 four가 있는지 조건을 걸고 싶을 때는 isin 명령을 쓰면 좋습니다.

In [48]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.623406 -0.949959 -2.115550  1.423069   two
2013-01-05 -0.006449  0.560998 -0.915864  0.329220  four

그 결과는 True/False로 반환되는데, 이것을 이용하면 조건에 맞는 데이터를 선택할 수 있습니다.

In [50]:
df

                   A         B         C         D
2013-01-01  0.027200 -1.020531  1.772950  0.837319
2013-01-02 -1.326676 -0.367714 -0.393435 -0.433656
2013-01-03 -1.623406 -0.949959 -2.115550  1.423069
2013-01-04 -1.822309 -0.027041  0.622573  0.248897
2013-01-05 -0.006449  0.560998 -0.915864  0.329220
2013-01-06 -1.165994  1.003240 -1.288996 -1.198633

df 변수에서 좀 더 통계 느낌의 데이터를 볼 때는 특정 함수를 적용시키면 좋습니다. 이때 사용하는 것이 apply 명령입니다. 누적합을 알고 싶을 때는 numpy의 cumsum을 이용하면 됩니다.

In [51]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.027200 -1.020531  1.772950  0.837319
2013-01-02 -1.299475 -1.388245  1.379516  0.403663
2013-01-03 -2.922881 -2.338205 -0.736035  1.826732
2013-01-04 -4.745191 -2.365245 -0.113462  2.075629
2013-01-05 -4.751640 -1.804247 -1.029326  2.404849
2013-01-06 -5.917634 -0.801007 -2.318322  1.206216

특별히 최대값과 최소값의 차이(혹은 거리)를 알고 싶다면 one-line 함수인 lambda를 이용할 수도 있습니다.

In [52]:
df.apply(lambda x: x.max() - x.min())

A    1.849510
B    2.023771
C    3.888500
D    2.621702
dtype: float64

## 1-4 pandas 이용해서 CCTV와 인구 현황 데이터 파악하기
이제 기초가 되는 pandas도 익혔으니 두 데이터를 정리해보겠습니다.

In [54]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

구별 CCTV 데이터에서 CCTV 전체 개수인 소계로 정렬하겠습니다.

In [55]:
CCTV_Seoul.sort_values(by='소계', ascending=True).head(5)

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  485        238    159     42    386
12  마포구  574        314    118    169    379
17  송파구  618        529     21     68    463
24  중랑구  660        509    121    177    109
23   중구  671        413    190     72    348

CCTV의 전체 개수가 가장 작은 구는'도봉구','마포구','송파구','중량구','중구'라는 것을 알 수 있습니다. 의아스러운 것은 강남 3구중 하나인 송파구가 CCTV가 가장 적은 구 중하나라는 것인데, 2장에서 보면 송파구는 범죄율이 결코 낮은 구가 아닙니다. 그런데 CCTV가 적은 구 중에 하나입니다.